-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 26, 2023 at 09:10 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `system-app`
--

-- --------------------------------------------------------

--
-- Table structure for table `abouts`
--

CREATE TABLE `abouts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `audios`
--

CREATE TABLE `audios` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL,
  `artist` varchar(100) NOT NULL,
  `duration` varchar(100) DEFAULT NULL,
  `release_date` varchar(100) DEFAULT NULL,
  `category_name` varchar(100) DEFAULT NULL,
  `subcategory_name` varchar(100) DEFAULT NULL,
  `sub_subcategory_name` varchar(100) DEFAULT NULL,
  `genre` varchar(100) DEFAULT NULL,
  `album` varchar(100) DEFAULT NULL,
  `short_description` text DEFAULT NULL,
  `long_description` text DEFAULT NULL,
  `youtube_iframe` text DEFAULT NULL,
  `header_content` text DEFAULT NULL,
  `meta_title` varchar(100) DEFAULT NULL,
  `meta_description` varchar(200) DEFAULT NULL,
  `is_featured` tinyint(1) DEFAULT NULL,
  `cover_image` varchar(255) DEFAULT NULL,
  `audio_file` varchar(255) DEFAULT NULL,
  `og` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `blogs`
--

CREATE TABLE `blogs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL,
  `slug` varchar(100) NOT NULL,
  `tags` varchar(100) DEFAULT NULL,
  `header_title` varchar(100) DEFAULT NULL,
  `category_name` varchar(100) DEFAULT NULL,
  `subcategory_name` varchar(100) DEFAULT NULL,
  `sub_subcategory_name` varchar(100) DEFAULT NULL,
  `book` varchar(100) DEFAULT NULL,
  `author` varchar(100) NOT NULL,
  `short_description` text DEFAULT NULL,
  `long_description` text DEFAULT NULL,
  `youtube_iframe` text DEFAULT NULL,
  `header_content` text DEFAULT NULL,
  `meta_title` varchar(100) DEFAULT NULL,
  `meta_description` varchar(200) DEFAULT NULL,
  `is_featured` tinyint(1) DEFAULT NULL,
  `featured_image` varchar(255) DEFAULT NULL,
  `file` varchar(255) DEFAULT NULL,
  `og` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `blogs`
--

INSERT INTO `blogs` (`id`, `title`, `slug`, `tags`, `header_title`, `category_name`, `subcategory_name`, `sub_subcategory_name`, `book`, `author`, `short_description`, `long_description`, `youtube_iframe`, `header_content`, `meta_title`, `meta_description`, `is_featured`, `featured_image`, `file`, `og`, `status`, `comment`, `created_at`, `updated_at`) VALUES
(1, 'মহিমান্বিত কুরআনের মু\'জিযা', 'miracles-of-mohimannito-quran', 'মহিমান্বিত কুরআন', NULL, 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'মহিমান্বিত কুরআন – মর্মার্থ ও শাব্দিক অনুবাদ', 'ইলাননূর সম্পাদনা পরিষদ', '<p>&lsquo;&lsquo;তারপর মূসা নিজের লাঠিটি নিক্ষেপ করলেন। সে তাদের বানোয়াট কীর্তিগুলো গ্রাস করতে থাকলো। তখন সকল যাদুকর সাজদাবনত হয়ে পড়লো এবং বলে উঠলো, আমরা রাববুল আলামীনের প্রতি বিশ্বাস স্থাপন করলাম। মূসা ও হারুনের রবের প্রতি।\" (সূরা শুআরা: ৪৬-৪৮)</p>', '<p>القرأن</p>\r\n<p>□○◇□○◇□○◇□○◇□○◇□○◇</p>\r\n<p>মহিমান্বিত কুরআন আমাদের নাবি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের সবচেয়ে বড় মু\'জিযা। প্রত্যেক নাবির সময়কার প্রেক্ষাপট অনুযায়ী তার মু\'জিযা হয়ে থাকে। এ জন্যই ফিরআউন সম্প্রদায়ের মধ্যে যখন যাদু বিদ্যা ব্যাপকভাবে প্রসার লাভ করলো, তখন মূসা আলাইহিস সালাম এমন একটি লাঠি নিয়ে আসলেন, যা যাদুকরেরা ব্যবহার করতো। কিন্তু মূসা আলাইহিস সালামের লাঠি যাদুকরদের সাপ সদৃশ সব লাঠি গিলে ফেললো। এতে যাদুকররা হয়রান হয়ে গেলো এবং বিস্মিত হলো। তারা বিশ্বাস করে নিলো যে, মূসা আ. যা নিয়ে এসেছেন, তা সত্য-সঠিক; যাদু নয়। আল্লাহ তা&lsquo;আলা বলেন:</p>\r\n<p>﴿فَأَلْقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ فَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ رَبِّ مُوسَىٰ وَهَارُونَ﴾</p>\r\n<p>&lsquo;&lsquo;তারপর মূসা নিজের লাঠিটি নিক্ষেপ করলেন। সে তাদের বানোয়াট কীর্তিগুলো গ্রাস করতে থাকলো। তখন সকল যাদুকর সাজদাবনত হয়ে পড়লো এবং বলে উঠলো, আমরা রাববুল আলামীনের প্রতি বিশ্বাস স্থাপন করলাম। মূসা ও হারুনের রবের প্রতি।\" (সূরা শুআরা: ৪৬-৪৮)</p>\r\n<p>ঈসা আলাইহিস সালামের যুগে যখন ডাক্তারী বিদ্যা ব্যাপক উন্নতি লাভ করেছিল, তখন তিনি আল্লাহর পক্ষ থেকে এমন মু\'জিযা নিয়ে আসলেন, যা দেখে সে যুগের ডাক্তারগণ দিশেহারা হয়ে গেলেন। তিনি মৃতদেরকে জীবিত এবং জটিল ও কঠিন রোগ ভালো করতেন। যেমন জন্মান্ধ ও কুষ্ঠরোগীকে সুস্থ করতেন এবং মাটি দিয়ে পাখির আকৃতি বানিয়ে তাতে ফুঁ দিলেই তা আল্লাহর অনুমতিতে পাখি হয়ে যেতো। এতে ডাক্তারদের বিবেক-বুদ্ধি হয়রান হয়ে গেলো এবং তারা স্বীকার করে নিলো যে, এগুলো আল্লাহ তা&lsquo;আলার পক্ষ হতেই। ঐদিকে আরবরা যখন ফাসাহাত ও বালাগাত তথা বিশুদ্ধ আরবী ভাষায় বাগপটুতা ও উচ্চাঙ্গের সাহিত্যিক মান দিয়ে ভাষণ-বক্তৃতা দেয়ায় পারদর্শিতা অর্জন করেছিল, তখন আল্লাহ তা&lsquo;আলা আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের জন্য এমন সাহিত্যিক মানসম্পন্ন মহিমান্বিত কুরআন দান করলেন, যার ভাষাগত মান তাদের কথা-বার্তা ও ভাষণ-বক্তৃতায় ব্যবহৃত বাক্যসমূহের বহু উর্ধ্বে এবং যার সম্মুখ অথবা পশ্চাৎ হতে বাতিল প্রবেশ করতে পারে না। আর এ কুরআন হলো সর্বযুগের চিরন্তন মু\'জিযা। আল্লাহ তা&lsquo;আলা সর্বযুগের সমস্ত মানুষের জন্য সর্বশেষ আসমানী রিসালাত হিসাবে মহিমান্বিত কুরআনকে একটি উজ্জ্বল মু\'জিযা বানিয়েছেন। প্রত্যেক যামানার লোকেরা কুরআনের মু\'জিযা প্রত্যক্ষ করছে এবং সেটা তিলাওয়াত করছে। তারা বিশ্বাস করতে বাধ্য হচ্ছে যে, কুরআন প্রকৃতপক্ষেই আল্লাহর কালাম। এটি কোনো মানুষের কালাম নয়। আল্লাহ তা&lsquo;আলা মানুষ ও জিনকে কুরআনের অনুরূপ একটি কিতাব অথবা কুরআনের সূরার অনুরূপ দশটি সূরা কিংবা সেটার সূরার অনুরূপ একটি সূরা রচনা করে নিয়ে আসার চ্যালেঞ্জ করেছেন। মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে নাবি হিসাবে প্রেরণ করার পর থেকে আজ পর্যন্ত কুরআনের চ্যালেঞ্জ রয়ে গেছে। ভবিষ্যতেও ইসলামের শত্রুরা কখনো কুরআনের অনুরূপ একটি কিতাব কিংবা কুরআনের সূরার ন্যায় একটি সূরা রচনা করে আনতে পারবে না। যদিও ইতিহাসের প্রত্যেক যুগেই রসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ও দীন ইসলামের শত্রুর সংখ্যা প্রচুর।</p>\r\n<p>আল্লাহ তা&lsquo;আলা আরো বলেন:</p>\r\n<p>﴿وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ وَادْعُوا شُهَدَاءَكُم مِّن دُونِ اللَّهِ إِن كُنتُمْ صَادِقِينَ فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ﴾</p>\r\n<p>&lsquo;&lsquo;আর যে কিতাবটি আমি আমার বান্দার উপর নাযিল করেছি তাতে যদি তোমরা সন্দেহ পোষণ করো তাহলে তার মতো একটি সূরা তৈরি করে আনো এবং নিজেদের সমস্ত সমর্থক গোষ্টীকে ডেকে আনো আল্লাহকে ছাড়া। তোমরা যদি সত্যবাদী হয়ে থাকো। কিন্তু তোমরা যদি এমনটি না করো আর নিঃসন্দেহে কখনই তোমরা এটা করতে পারবেনা, তাহলে ভয় করো সেই আগুনকে, যার ইন্ধন হবে মানুষ ও পাথর যা তৈরি রাখা হয়েছে কাফেরদের জন্য।\" (সূরা আল বাকারা: ২৩-২৪)</p>\r\n<p>সুতরাং কুরআনের চ্যালেঞ্জ এখনো বিদ্যমান রয়েছে। এটা কিয়ামত পর্যন্ত বিদ্যমান থাকবে। আল্লাহ তা&lsquo;আলা বলেন, তোমরা যদি এখন এমনটি করতে না পারো, নিঃসন্দেহে কখনই তোমরা এটা করতে পারবে না। আল্লাহ তা&lsquo;আলা আরো বলেন:</p>\r\n<p>﴿أَمْ يَقُولُونَ تَقَوَّلَهُ بَل لَّا يُؤْمِنُونَ فَلْيَأْتُوا بِحَدِيثٍ مِّثْلِهِ إِن كَانُوا صَادِقِينَ﴾</p>\r\n<p>&lsquo;&lsquo;তারা কি বলে যে, এ ব্যক্তি নিজেই কুরআন রচনা করে নিয়েছে? প্রকৃত ব্যাপার হচ্ছে তারা ঈমান গ্রহণ করতে চায় না। তাদের এ কথার ব্যাপারে তারা যদি সত্যবাদী হয় তাহলে এ বাণীর মত একটি বাণী তৈরি করে আনুক।\" (সূরা তুর: ৩৩-৩৪)</p>\r\n<p>শাইখুল ইসলাম ইমাম ইবনে তাইমীয়া রাহিমাহুল্লাহ বলেন, এ চ্যালেঞ্জটি ছিল মাক্কায়। কেননা সূরা হুদ, সূরা ইউনুস এবং সূরা তুর মক্কী সূরার অন্তর্ভুক্ত। মাদিনায় হিজরত করার পর এ চ্যালেঞ্জের পুনরাবৃত্তি করা হয়েছে। মাদানি সূরা বাকারায় আল্লাহ তা&lsquo;আলা বলেন:</p>\r\n<p>﴿وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ وَادْعُوا شُهَدَاءَكُم مِّن دُونِ اللَّهِ إِن كُنتُمْ صَادِقِينَ فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ﴾</p>\r\n<p>&lsquo;&lsquo;আর যে কিতাবটি আমি আমার বান্দার উপর নাযিল করেছি তাতে যদি তোমরা সন্দেহ পোষণ করো তাহলে তার মতো একটি সূরা তৈরি করে আনো এবং নিজেদের সমস্ত সমর্থক গোষ্টীকে ডেকে আনো আল্লাহকে ছাড়া। তোমরা যদি সত্যবাদী হয়ে থাকো। কিন্তু তোমরা যদি এমনটি না করো আর নিসন্দেহে কখনই তোমরা এটা করতে পারবেনা, তাহলে ভয় করো সেই আগুনকে, যার ইন্ধন হবে মানুষ ও পাথর যা তৈরি রাখা হয়েছে কাফেরদের জন্য।\" (সূরা আল বাকারা: ২৩-২৪)</p>\r\n<p>এখানে দু&rsquo;টি বিষয় উল্লেখ করা হয়েছে।</p>\r\n<p>▪︎ ১. আল্লাহ তা&lsquo;আলা বলেন:</p>\r\n<p>﴿ فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ﴾</p>\r\n<p>&lsquo;&lsquo;কিন্তু তোমরা যদি এমনটি না করো আর নিঃসন্দেহে কখনই তোমরা এটা করতে পারবে না, তাহলে ভয় করো সেই আগুনকে, যার ইন্ধন হবে মানুষ ও পাথর&rsquo;&rsquo;। তোমরা যখন এমনটি করতে পারবেনা, তখন জেনে নিবে যে, এটি সত্য। সুতরাং তোমরা তাকে মিথ্যায়ন করার ব্যাপারে আল্লাহকে ভয় করো। আর তা না করলে, তোমাদেরকে পরিবেষ্টন করবে সেই আযাব, যার ওয়াদা করা হয়েছে সত্য অস্বীকার কারীদের জন্য।</p>\r\n<p>▪︎২.আল্লাহ তা&lsquo;আলা বলেন: وَلَن تَفْعَلُوا &lsquo;&lsquo;আর নিঃসন্দেহে কখনই তোমরা এটা করতে পারবেনা&rsquo;&rsquo;। এখানে لن অব্যয় দ্বারা ভবিষ্যতে তাদের ক্ষমতা অর্জিত হওয়াকে নাকোচ করা হয়েছে। এতে সাব্যস্ত করা হয়েছে যে, ভবিষ্যতেও তারা কুরআনের অনুরূপ একটি সূরা রচনা করে আনয়ন করতে পারবেনা। কুরআন এভাবেই সংবাদ প্রদান করেছে।</p>\r\n<p>কুরআনের সুস্পষ্ট বক্তব্য এবং মুতাওয়াতির হাদিসের মাধ্যমে সাব্যস্ত হয়েছে যে, সূরা বানি ইসরাঈল মাক্কি সূরা। ইসরা বা নাবি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের নৈশ ভ্রমণের মাধ্যমে এ সূরার সূচনা হয়েছে। আল্লাহ তা&lsquo;আলা বলেছেন:</p>\r\n<p>﴿قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لاَ يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا﴾</p>\r\n<p>&lsquo;&lsquo;হে নাবি তুমি বলো, সমস্ত মানব ও জিন যদি এ কুরআনের অনুরূপ রচনা করার জন্য জড়ো হয় এবং তারা পরস্পরের সাহায্যকারী হয়; তবুও তারা কখনো এর অনুরূপ রচনা করে আনতে পারবে না।\" (সূরা বনী ইসরাঈল: ৮৮)</p>\r\n<p>নাবি করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে আল্লাহ তা&lsquo;আলা আদেশ করেছেন, তিনি যেন সমস্ত সৃষ্টিকে চ্যালেঞ্জ করে অকাট্যভাবে এ সংবাদ দিয়ে দেন যে, তারা সকলে মিলে ঐক্যবদ্ধভাবে চেষ্টা করলেও কুরআনের অনুরূপ কিতাব রচনা করতে পারবে না। যদিও তারা এ ব্যাপারে পরস্পরকে সাহায্য-সহযোগিতা করে। সমগ্র সৃষ্টির জন্যই কুরআনের এ চ্যালেঞ্জ। যারা কুরআন শুনেছে, তাদের প্রত্যেকেই এ চ্যালেঞ্জ সম্পর্কে অবগত আছে। কাছের কিংবা দূরের সকলেই এটি শুনেছে। সেই সঙ্গে এটি অবগত হওয়া গেছে যে, কাফেরদের কেউই কুরআনের মোকাবেলা করার সাহস পায়নি এবং কুরআনের অনুরূপ একটি সূরাও আনয়ন করতে পারেনি।</p>\r\n<p>নাবি করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে প্রেরণ করার সময় থেকে শুরু করে আজ পর্যন্ত এ চ্যালেঞ্জ রয়ে গেছে। নাবি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের নবুওয়াত প্রাপ্তির পূর্বে আরবের সকলেই ছিল কাফের। তিনি যখন নবি হিসাবে প্রেরিত হলেন তখন অল্প সংখ্যক লোকই কেবল তার অনুসরণ করলো। কাফিররা নবি করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কথাকে বাতিল প্রমাণ করার জন্য সর্বাত্মক প্রচেষ্টা চালিয়েছিল এবং সম্ভাব্য সকল পথ ও পদ্ধতি অবলম্বন করেছিল। তারা কখনো কখনো আহলে কিতাবদের কাছে গিয়ে গায়েবী বিষয়ে প্রশ্ন শিখে নিতো। যাতে পরবর্তীতে তারা এ বিষয়ে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে প্রশ্ন করতে পারে। যেমন তারা প্রশ্ন করেছিল ইউসুফ আলাইহিস সালামের ঘটনা সম্পর্কে, আসহাফে কাহাফ সম্পর্কে এবং যুলকারনাইনের ঘটনা সম্পর্কে। সেই সঙ্গে তারা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সম্পর্কে সম্মিলিতভাবে একটি মিথ্যা কথা বলার জন্য একাধিক বৈঠকে মিলিত হয়েছিল। তারা তার জন্য একাধিক উদাহরণ পেশ করতে লাগলো। অতঃপর তারা তাকে এমন ব্যক্তির সাথে সাদৃশ্য দিল, যার সাথে তার পার্থক্য সুস্পষ্ট। কখনো তারা তাকে পাগল বলেছে, কখনো যাদুকর বলেছে, কখনো গণক বলেছে এবং কখনো কবি বলেছে। তারা তার সম্পর্কে এমনসব কথা বলেছে, যা তারা নিজেরা এবং প্রত্যেক বিবেকবান লোক শুনে বুঝতে সক্ষম হতো যে সেটা সম্পূর্ণ মিথ্যা। কুরআন যেহেতু তাদের দাবিকে বাতিল করে সেটার মোকাবেলা করার জন্য চ্যালেঞ্জের পর চ্যালেঞ্জ করেছে, তাই জানা গেলো যে, তারা যদি মোকাবেলা করতে পারতো, তাহলে অবশ্যই তারা তা করতো। সুতরাং চ্যালেঞ্জের মোকাবেলা করার যথেষ্ট প্রয়োজন থাকা সত্ত্বেও যদি তাদের মোকাবেলা করার ক্ষমতা থাকতো, তাহলে অবশ্যই তারা কুরআনের অনুরূপ একটি কিতাব কিংবা সেটার অনুরূপ একটি সূরা রচনা করে নিয়ে আসতো। সমগ্র যমীনবাসীর জন্যই কুরআনের এ চ্যালেঞ্জ রয়ে গেছে। সুতরাং প্রত্যেকের কাছেই সুস্পষ্টভাবে প্রমাণিত হলো যে, সমস্ত যমীনবাসী কৌশল কিংবা বিনা কৌশলে এই কুরআনের অনুরূপ একটি কুরআন আনয়ন করতে অক্ষম। কুরআনের মু\'জিযা ঐসব নিদর্শনের চেয়েও অধিক সু্স্পষ্ট ও পরিপূর্ণ যা কুরআনে বারবার উল্লেখ করা হয়েছে। যেমন মৃতদেরকে জীবিত করার বিষয়টি উল্লেখ করা যেতে পারে। কুরআনের অনুরূপ মু\'জিযা আর কোনো নবী আনয়ন করতে পারেনি।</p>\r\n<p>ইসলামের প্রথম যুগে মাক্কাতে নবি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের অনুসারীর সংখ্যা যখন একদম কমছিল তখন তিনি আল্লাহর পক্ষ হতে একটি অকাট্য খবর দিয়েছেন যে, সমস্ত জিন এবং ইনসান যদি ঐক্যবদ্ধ হতো তবুও সে যুগে কুরআনের ন্যায় একটি কিতাব রচনা করে আনতে পারতো না। পরবর্তী যুগসমূহেও একই কথা। নবি করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম অত্যন্ত দৃঢ়তার সাথে ও সুদৃঢ় বিশ্বাস নিয়ে এ কথা বলেছেন। কিন্তু মনের মধ্যে সন্দেহ নিয়ে এ ধরণের কথা কেবল ঐ ব্যক্তিই বলতে পারে, যে নিজের মিথ্যাবাদিতা প্রকাশিত হওয়ার ভয় করে এবং অপদস্থ হওয়া ও মানুষ তার কথা সত্যায়ন না করার আশঙ্কা করে। আর যখন দৃঢ়চিত্তে ও পর্বত সদৃশ ঈমান নিয়ে বলবে, তখন আল্লাহর পক্ষ হতে নিশ্চিত সংবাদ নিয়েই বলবে। মানুষের পরিচিত ও স্বভাবগত যেসব ইলম রয়েছে, তার মধ্যে এমন কিছু আছে বলে মানুষ জানেনা, যা সমগ্র সৃষ্টি মিলে আনয়ন করতে অক্ষম। আলেমগণ কেবল ঐসব কালাম রচনা করতে অক্ষম, যা তাদের ক্ষমতার বাইরে। সুতরাং মানুষ যেহেতু কুরআনের অনুরূপ কালাম রচনা করে আনয়ন করতে পারে না, তখন এটি বিশ্বাস করা আবশ্যক যে, কুরআন একটি চিরন্তন মু\'জিযা। বিভিন্ন পদ্ধতিতেই কুরআনুল কারীমের মুজিযা প্রমাণ করা যায়। কুরআনের শব্দমালা, গ্রন্থনা, অলঙ্কারপূর্ণ শব্দের মাধ্যমে বিষয়বস্তুর প্রতি নির্দেশনা প্রদান, তার আদেশ-নিষেধ, আল্লাহ তা&lsquo;আলার অতি সুন্দর নাম ও সুউচ্চ গুণাবলীর সংবাদ প্রদান, তার ফেরেশতাদের খবরাদি, ভবিষ্যৎ ও অতীতের গায়েবী বিষয় সম্পর্কিত খবর, পুনরুত্থান দিবস সংক্রান্ত খবর, ঈমান ও ইয়াকীনের দলীল-প্রমাণাদি এবং অন্যান্য বিষয়েও কুরআন একটি চিরন্তন মু\'জিযা।</p>', NULL, NULL, NULL, NULL, 1, 'mohimannito-quran-marmartho-o-sabdik-onubad-front-cover.jpg', NULL, NULL, NULL, NULL, '2023-07-25 00:20:31', '2023-07-26 01:09:15'),
(2, 'মহিমান্বিত কুরআনে গুনাহ মাফের দু‘আ', 'mohimannito-qurane-gunah-mafer-dua', 'মহিমান্বিত কুরআন', NULL, 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'মহিমান্বিত কুরআন – মর্মার্থ ও শাব্দিক অনুবাদ, শুয়ুখ সংস্করণ', 'ইলাননূর সম্পাদনা পরিষদ', '<p>رَبِّ إِنِّىْ ظَلَمْتُ نَفْسِىْ فَاغْفِرْ لِىْ \"রব্বি ইন্নী যলামতু নাফসী ফাগফিরলী।\" \"হে আমার রব, নিশ্চয় আমি আমার নফ্সের প্রতি যুল্ম করেছি, সুতরাং আপনি আমাকে ক্ষমা করে দিন।\"</p>', '<div class=\"post_content\">\r\n<ul>\r\n<ul>\r\n<li>১. رَبِّ إِنِّىْ ظَلَمْتُ نَفْسِىْ فَاغْفِرْ لِىْ \"রব্বি ইন্নী যলামতু নাফসী ফাগফিরলী।\" \"হে আমার রব, নিশ্চয় আমি আমার নফ্সের প্রতি যুল্ম করেছি, সুতরাং আপনি আমাকে ক্ষমা করে দিন।\" [1]</li>\r\n<li>২. أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ \"আনতা ওয়ালিয়্যুনা- ফাগফিরলানা- ওয়ারহামনা- ওয়া আনতা খাইরুল গা-ফিরীন।\" \"আপনি আমাদের অভিভাবক। সুতরাং আমাদের ক্ষমা করে দিন এবং আপনি উত্তম ক্ষমাশীল।\" [2]</li>\r\n<li>৩. رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ \"রব্বিগফির ওয়ারহাম ওয়া আনতা খাইরুর্ র-হিমীন।\" \"হে আমাদের রব! আপনি ক্ষমা করুন, দয়া করুন এবং আপনিই সর্বশ্রেষ্ঠ দয়ালু।\" [3]</li>\r\n<li>৪. رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ \'রব্বানা- আতমিম লানা- নূরানা- ওয়াগফিরলানা- ইন্নাকা &lsquo;আলা- কুল্লি শাইয়িন ক্বদীর।\" \"হে আমাদের রব! আমাদের জন্য আমাদের আলো পূর্ণ করে দিন এবং আমাদেরকে ক্ষমা করুন; নিশ্চয় আপনি সর্ববিষয়ে সর্বক্ষমতাবান।\" [4]</li>\r\n<li>৫. سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ \"সামি&lsquo;না- ওয়া আত্বা&lsquo;না- গুফরা-নাকা রব্বানা- ওয়া ইলাইকাল মাসীর।\" \"আমরা শুনলাম এবং মানলাম। হে আমাদের রব! আমরা আপনারই (নিকট) ক্ষমা প্রার্থনা করি, আর আপনার দিকেই প্রত্যাবর্তনস্থল।\" [5]</li>\r\n<li>৬. رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ &hellip; وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ \"রব্বানা- তাক্বববাল মিন্না- ইন্নাকা আন্&zwnj;তাস্ সামী&lsquo;উল &lsquo;আলীম। ওয়াতুব &lsquo;আলায়না-, ইন্নাকা আনতাত্ তাওওয়া-বুর্ রহীম।\" \'&lsquo;হে আমাদের রব্! আপনি আমাদের পক্ষ হ&rsquo;তে এটি কবূল করুন। নিশ্চয় আপনি সর্বশ্রোতা ও সর্বজ্ঞ&rsquo;। &lsquo;আমাদের ক্ষমা করুন। নিশ্চয় আপনি অধিক তওবা কবূলকারী ও দয়াময়।\" [6]</li>\r\n<li>৭. ভুল-ভ্রান্তিবশতঃ কোন কাজ হয়ে গেলে তা থেকে ক্ষমা প্রার্থনার দু&lsquo;আ: رَبَّنَا لَاتُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا \"রব্বানা- লা- তুআ-খিযনা ইন্নাসীনা- আও আখত্বা&rsquo;না-।\" \'&lsquo;হে আমাদের রব্! আমাদের দায়ী করেন না যদি আমরা ভুলে যাই কিংবা ভুল করি।\" [7]</li>\r\n<li>৮. কোন কাজ সহজ হওয়া ও কাজ সম্পাদনে ভুল-ত্রুটি ক্ষমা চাওয়া এবং বরকত চাওয়ার দু&lsquo;আ: رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَه عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِه وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ \"রব্বানা- ওয়ালা- তাহমিল &lsquo;আলায়না ইসরান কামা- হামালতাহূ &lsquo;আলাল্লাযীনা মিন ক্ববলিনা- রব্বানা- ওয়ালা- তুহাম্মিলনা- মা-লা- ত্বা-ক্বাতা লানা- বিহী, ওয়া&lsquo;ফু &lsquo;আন্না- ওয়াগফির লানা- ওয়ারহামনা- আনতা মাওলা-না- ফানসুরনা- &lsquo;আলাল ক্বওমিল কা-ফিরীন।\" \"হে আমাদের রব্! আমাদের ওপর ভারী ও কঠিন কাজের বোঝা অর্পণ করেন না, যেমন আমাদের পূর্ববর্তী লোকেদের ওপর অর্পণ করেছিলে। হে আমাদের রব! আমাদের ওপর এমন কঠিন দায়িত্ব দিয়েন না যা সম্পাদন করার শক্তি আমাদের নেই। আমাদের পাপ মোচন করুন, আমাদের ক্ষমা কর এবং আমাদের প্রতি দয়া করুন। তুমিই আমাদের রব্! সুতরাং কাফের সম্প্রদায়ের বিরুদ্ধে আমাদের সাহায্য করুন।\" [8]</li>\r\n<li>৯. গুনাহ মাফ ও জাহান্নামের &lsquo;আযাব থেকে বাঁচার দু&lsquo;আ: رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ \"রব্বানা- ইন্নানা- আ-মান্না- ফাগফিরলানা- যুনূবানা- ওয়াক্বিনা- &lsquo;আযা-বান্ন-র।\" \"হে আমাদের রব্! নিশ্চয় আমরা ঈমান এনেছি। অতএব আমাদের গুনাহসমূহ ক্ষমা করুন এবং আমাদেরকে জাহান্নামের &lsquo;আযাব হ&rsquo;তে রক্ষা করুন।\" [9]</li>\r\n<li>১০. জাহান্নামের &lsquo;আযাব থেকে বাঁচার এবং ঈমানের সাথে মৃত্যুবরণ করার জন্য দু&lsquo;আ: رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ 191 رَبَّنَا إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَه وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ 192 رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِىْ لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ 193 \"রব্বানা- মা- খলাক্বতা হা-যা-বা-ত্বিলান, সুবহা-নাকা ফাক্বিনা- &lsquo;আযা-বান্ন-র। রব্বানা- ইন্নাকা মান্ তুদখিলিন্না-রা ফাক্বদ্ আখযাইতাহূ, ওয়া মা- লিযযা-লিমীনা মিন্ আনসা-র। রব্বানা- ইন্নানা- সামি&lsquo;না- মুনা-দিআয় ইউনা-দী লিল ঈমা-নি আন্ আ-মিনূ বিরব্বিকুম ফা- আ-মান্না-, রব্বানা- ফাগফিরলানা- যুনূবানা- ওয়া কাফফির &lsquo;আন্না- সাইয়িআ-তিনা- ওয়া ত্বওয়াফফানা- মা&lsquo;আল আবরা-র।\" \"&lsquo;হে আমাদের রব! তুমি এগুলিকে অনর্থক সৃষ্টি করেননি। মহা পবিত্র আপনি। অতএব আপনি আমাদেরকে জাহান্নামের &lsquo;আযাব থেকে বাঁচান&rsquo;! &lsquo;হে আমাদের রব! নিশ্চয় আপনি যাকে জাহান্নামে নিষ্পাপ করেন, তাকে আপনি লাঞ্ছিত করব। আর সীমালঙ্ঘনকারীদের জন্যে তো কোন সাহায্যকারী নেই&rsquo;। &lsquo;হে আমাদের রব! নিশ্চয় আমরা একজন আহবানকারীকে (মুহাম্মাদ) শুনেছি যিনি ঈমানের প্রতি আহবান করছেন এই বলে যে, তোমরা তোমাদের প্রতিপালকের প্রতি বিশ্বাস স্থাপন কর। অতঃপর সে মতে আমরা বিশ্বাস স্থাপন করেছি। অতএব হে আমাদের রব্! আমাদের পাপসমূহ ক্ষমা করুন ও আমাদের দোষ-ত্রুটিসমূহ মার্জনা করুন এবং আমাদেরকে সৎকর্মশীলদের সাথে মৃত্যুদান করুন (অর্থাৎ তাদের মধ্যে শামিল কর)।\" [10]</li>\r\n<li>১১. আল্লাহর হুকুম অমান্য করার পাপ থেকে ক্ষমা চাওয়ার দু&lsquo;আ: رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ \"রব্বানা যলামনা- আনফুসানা- ওয়া ইল্লাম তাগফিরলানা- ওয়া তারহামনা- লানাকূনান্না মিনাল খা-সিরীন।\" \"হে আমাদের রব! আমরা আমাদের নিজেদের উপর যুল্ম করেছি। এক্ষণে যদি আপনি আমাদের ক্ষমা না করেন ও দয়া না করেন, তাহ&rsquo;লে অবশ্যই আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হয়ে পড়ব।\" [11]</li>\r\n<li>১২. নিজের ও ভাইয়ের জন্য ক্ষমা চেয়ে দু&lsquo;আ: رَبِّ اغْفِرْ لِىْ وَلِأَخِىْ وَأَدْخِلْنَا فِىْ رَحْمَتِكَ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ \"রব্বিগ্ ফিরলী ওয়ালি আখী ওয়া আদখিলনা- ফী রহমাতিকা ওয়া আনতা আরহামুর্ র-হিমীন।\" \"হে আমার রব! আমাকে মাফ করো এবং আমার ভাইকে মাফ করো। এবং আমাদেরকে তোমার রহমতের মধ্যে প্রবেশ করাও। বস্তুত তুমিই শ্রেষ্ঠ দয়ালু।\" [12]</li>\r\n<li>১৩. অবৈধ ও নিষিদ্ধ বিষয়ের কামনা করলে যে পাপ হয়, তা ক্ষমার জন্য দু&lsquo;আ : رَبِّ إِنِّىْ أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِىْ بِه عِلْمٌ وَإِلَّا تَغْفِرْ لِىْ وَتَرْحَمْنِىْ أَكُنْ مِّنَ الْخَاسِرِينَ \"রব্বি ইন্নী আ&lsquo;ঊযুবিকা আন্ আস্আলাকা মা- লায়সা লী বিহী &lsquo;ইলমুন্, ওয়া ইল্লা- তাগফিরলী ওয়া তারহামনী আকুম্ মিনাল খা-সিরীন।\" \'&lsquo;হে আমার রব! আমি তোমার নিকট এমন বিষয়ে আবেদন করা থেকে আশ্রয় প্রার্থনা করছি, যে বিষয়ে আমার কোন জ্ঞান নেই। এক্ষণে যদি আপনি আমাকে ক্ষমা না করেন এবং আমার প্রতি দয়া না করেন, তাহ&rsquo;লে আমি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হয়ে যাব।\" [13]</li>\r\n<li>১৪. সন্তানাদিসহ নিজে মুসল্লী হওয়া এবং পিতা-মাতা সহ সমস্ত মুসলিম ব্যক্তির জন্য দু&lsquo;আ (ইবরাহীম (আ.)-এর দু&lsquo;আ): رَبِّ اجْعَلْنِىْ مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِىْ رَبَّنَا وَتَقَبَّلْ دُعَاءِ 40 رَبَّنَا اغْفِرْ لِىْ وَلِوَالِدَىَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ 41 \"রব্বিজ্&lsquo;আলনী মুক্বীমাস্ সলা-তি ওয়া মিন্ যুররিইয়্যাতী, রব্বানা- ওয়া তাক্বব্বাল্ দু&lsquo;আ-। রব্বানাগফিরলী ওয়ালি ওয়া-লি দাইয়্যা ওয়ালিল্ মু&rsquo;মিনীনা ইয়াওমা ইয়াকূমুল্ হিসা-ব।\" \"হে আমার রব! আমাকে ছালাত ক্বায়িমকারী করুন এবং আমার সন্তানদের মধ্য থেকেও। হে আমাদের রব! আমার দু&lsquo;আ কবূল করুন&rsquo;! &lsquo;হে আমাদের রব্! আমাকে ও আমার পিতা-মাতাকে এবং ঈমানদার সকলকে ক্ষমা করুন যেদিন হিসাব দন্ডায়মান হবে।\" [14]</li>\r\n<li>১৫. আল্লাহর রহমত কামনা ও ক্ষমা চাওয়ার দু&lsquo;আ : رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ \"রব্বানা- আ-মান্না- ফাগফির্ লানা- ওয়ার্&zwnj;হামনা- ওয়া আন্&zwnj;তা খাইরুর্ রা-হিমীন।\" \"হে আমাদের রব্! আমরা বিশ্বাস স্থাপন করেছি, তুমি আমাদেরকে ক্ষমা কর এবং আমাদের প্রতি রহম কর। তুমি তো সর্বশ্রেষ্ঠ দয়ালু।\" [15]</li>\r\n<li>১৬. হিংসা-বিদ্বেষ দূর করার দু&lsquo;আ: رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِىْ قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ \"রব্বানাগফির লানা- ওয়া লিইখ্ওয়া-নিনাল্লাযীনা সাবাকূনা- বিল ঈমা-নি ওয়ালা- তাজ্&lsquo;আল ফী কুলূবিনা- গিল্লাল লিল্লাযীনা আ-মানূ রব্বানা- ইন্নাকা রাঊফুর্ রহীম্।\" \"হে আমাদের রব! আমাদেরকে ও আমাদের পূর্ববর্তী ভাইয়েরা যারা ঈমান এনেছে তাদের ক্ষমা কর, ঈমানদারদের বিরুদ্ধে আমাদের অন্তরে কোন বিদ্বেষ রেখো না। হে আমাদের রব্! নিশ্চয় আপনি দয়ালু পরম করুণাময়।\" [16]</li>\r\n<li>১৭. কাফেরদের ওপর বিজয়ের জন্য আল্লাহর কাছে প্রার্থনা: رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ \"রব্বানাগফির লানা- যুনূবানা- ওয়াইসরা-ফানা- ফী আমরিনা- ওয়া সাব্বিত আক্বদা-মানা- ওয়ানসুরনা- &lsquo;আলাল্ ক্বওমিল কা-ফিরীন।\" \'&lsquo;হে আমাদের রব! আমাদের পাপগুলো ক্ষমা করে দিন, আর আমাদের কাজে যতটুকু বাড়াবাড়ি হয়ে গেছে তাও মাফ করে দিন। আমাদেরকে দৃঢ় রাখুন এবং কাফেরদের ওপর আমাদেরকে সাহার্য করুন।\" [17]</li>\r\n<li>১৮. ফিতনা-ফাসাদ থেকে বাঁচার জন্য আল্লাহর নিকট প্রার্থনা: رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ 4 رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ 5 \"রব্বানা- &lsquo;আলায়কা তাওয়াক্কালনা- ওয়া ইলায়কা আনাবনা- ওয়া ইলায়কাল মাসীর। রব্বানা- লা- তাজ্&lsquo;আলনা- ফিতনাতাল লিল্লাযীনা কাফারূ ওয়াগফিরলানা- রব্বানা- ইন্নাকা আন্&zwnj;তাল্ &lsquo;আযীযুল হাকীম।\" \'&lsquo;হে আমাদের রব! আমরা আপনার ওপরই ভরসা করেছি, আপনার দিকেই মুখ করেছি এবং আপনার দিকেই আমাদের ফিরে যেতে হবে। হে আমাদের রব্! আপনি আমাদেরকে কাফেরদের জন্য পরীক্ষার পাত্র করবেন না। হে আমাদের রব! আপনি আমাদের ক্ষমা করুন, নিশ্চয় আপনি মহা শক্তিধর ও প্রজ্ঞাময়।\" [18]</li>\r\n<li>১৯. বালা-মুসীবাত ও মহামারির সময় পিতা-মাতা ও মু&rsquo;মিনদের রক্ষার জন্য ও যালিমদের ধ্বংসের জন্য নূহ (আ.)-এর দু&lsquo;আ : رَبِّ اغْفِرْ لِىْ وَلِوَالِدَىَّ وَلِمَنْ دَخَلَ بَيْتِىَ مُؤْمِنًا وَّلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا \"রব্বিগফিরলী ওয়ালি ওয়া-লি দাইয়্যা ওয়ালিমান দাখালা বায়তিয়া মু&rsquo;মিনাও ওয়ালিল মু&rsquo;মিনীনা ওয়াল মু&rsquo;মিনা-তি ওয়ালা- তাযিদিযয-লিমীনা ইল্লা- তাবা-রা-।\" \"হে আমার রব্! আমাকে ও আমার পিতা-মাতাকে ক্ষমা করুন, আর যে ব্যক্তি আমার বাড়ীতে মু&rsquo;মিন অবস্থায় প্রবেশ করবে তাকে ক্ষমা করুন এবং সকল মু&rsquo;মিন নর-নারীকে ক্ষমা করুন। আর যালিমদের ধ্বংস বৃদ্ধি করুন।\" [19]</li>\r\n<li>২০. পাপ ক্ষমা চেয়ে জাহান্নামের আগুন থেকে বাঁচার জন্য দু&lsquo;আ: رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ \"রব্বানা- ইন্নানা আ-মান্না- ফাগফিরলানা- যুনূবানা-, ওয়া ক্বিনা- &lsquo;আযা-বান্না-র।\" \'&lsquo;হে আমাদের রব! আমরা ঈমান এনেছি, অতএব আপনি আমাদের গুনাহ ক্ষমা করে দিন এবং আমাদেরকে জাহান্নামের আগুন হ&rsquo;তে রক্ষা করুন&rsquo;।[20]</li>\r\n</ul>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<ul>-----------------\r\n<li>[1]. সূরা আল ক্বসাস ২৮ : ১৬। [2]. সূরা আল আ&lsquo;রাফ ০৭ : ১৫৫।</li>\r\n<li>[3]. সূরা আল মু&rsquo;মিনূন ২৩ : ১১৮।</li>\r\n<li>[4]. সূরা আত্ তাহরীম ৬৬ : ০৮।</li>\r\n<li>[5]. সূরা আল বাক্বারাহ্ ০২ : ২৮৫।</li>\r\n<li>[6]. সূরা আল বাক্বারাহ্ ২ : ১২৭-২৮।</li>\r\n<li>[7]. সূরা আল বাক্বারাহ্ ০২ : ২৮৬। [8]. সূরা আল বাক্বারাহ্ ০২ : ২৮৬।</li>\r\n<li>[9]. সূরা আ-লি &lsquo;ইমরা-ন ৩ : ১৬।</li>\r\n<li>[10]. সূরা আ-লি &lsquo;ইমরা-ন ০৩ : ১৯১-১৯৩।</li>\r\n<li>[11]. সূরা আল আ&lsquo;রাফ ০৭ : ২৩।</li>\r\n<li>[12]. সূরা আল আ&lsquo;রাফ ০৭ : ১৫১।</li>\r\n<li>[13]. সূরা হূদ ১১ : ৪৭।</li>\r\n<li>[14]. সূরা ইব্রা-হীম ১৪ : ৪০-৪১। [15]. সূরা আল মু&rsquo;মিনূন ২৩ : ১০৯।</li>\r\n<li>[16]. সূরা আল হাশ্র ৫৯ : ১০।</li>\r\n<li>[17]. সূরা আ-লি &lsquo;ইমরা-ন ০৩ : ১৪৭।</li>\r\n<li>[18]. সূরা আল মুমতাহিনাহ্ ৬০ : ৪-৫।</li>\r\n<li>[19]. সূরা নূহ ৭১ : ২৮।</li>\r\n<li>[20] সূরা আ-লি &lsquo;ইমরা-ন ০৩ : ১৬।</li>\r\n--------------- IFM desk ---------------</ul>\r\n</div>\r\n<p>&nbsp;</p>', NULL, NULL, NULL, NULL, NULL, 'mohimannito-quran-shuyukh-songskoron-front-cover.jpg', NULL, NULL, 1, NULL, '2023-07-26 00:26:45', '2023-07-26 00:26:45');

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `slug` varchar(100) NOT NULL,
  `category_name` varchar(100) NOT NULL,
  `subcategory_name` varchar(100) NOT NULL,
  `sub_subcategory_name` varchar(100) DEFAULT NULL,
  `sku` varchar(100) NOT NULL,
  `sale_price` varchar(100) DEFAULT NULL,
  `regular_price` varchar(100) NOT NULL,
  `commission` varchar(100) DEFAULT NULL,
  `publisher` varchar(100) NOT NULL,
  `ranking` varchar(4) DEFAULT NULL,
  `author` varchar(100) NOT NULL,
  `short_description` text DEFAULT NULL,
  `long_description` text DEFAULT NULL,
  `specification` text DEFAULT NULL,
  `youtube_iframe` text DEFAULT NULL,
  `header_content` text DEFAULT NULL,
  `meta_title` varchar(100) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `order_type` tinyint(1) DEFAULT NULL,
  `is_featured` tinyint(1) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `page_images` varchar(255) DEFAULT NULL,
  `og` varchar(255) DEFAULT NULL,
  `file` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `name`, `slug`, `category_name`, `subcategory_name`, `sub_subcategory_name`, `sku`, `sale_price`, `regular_price`, `commission`, `publisher`, `ranking`, `author`, `short_description`, `long_description`, `specification`, `youtube_iframe`, `header_content`, `meta_title`, `meta_description`, `order_type`, `is_featured`, `image`, `page_images`, `og`, `file`, `status`, `comment`, `created_at`, `updated_at`) VALUES
(1, 'মহিমান্বিত কুরআন – মর্মার্থ ও শাব্দিক অনুবাদ', 'mohimannito-quran-marmartho-o-sabdik-onubad-1', 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'MQ001', '990', '990', NULL, 'ইলাননূর পাবলিকেশন', NULL, 'ইলাননূর সম্পাদনা পরিষদ', '<p>সংকলক: ইলাননূর সম্পাদনা পরিষদ</p>\r\n<p>সংস্করণ: তৃতীয়</p>\r\n<p><strong>বিষয়: মহিমান্বিত কুরআনের মমার্থ ও শাব্দিক অনুবাদ</strong></p>\r\n<p>আপনি কি কুরআন না বুঝেই পড়ছেন, শুনছেন? কুরআন ছাড়া আর কী আপনি না বুঝে পড়েন, শোনেন?</p>\r\n<p><strong>মহিমান্বিত কুরআন</strong>, মর্মার্থ শাব্দিক অনুবাদের নিয়মিত অধ্যয়ন-- শিশুর ভাষা শেখার মতই আপনাকে কুরআন বুঝতে সাহায্য করবে, ইন-শা~আল্লাহ।</p>', '<h2>মহিমান্বিত কুরআনের সংক্ষিপ্ত বিবরণী</h2>\r\n<p><strong>\'মহিমান্বিত কুরআন &ndash; মর্মার্থ ও শাব্দিক অনুবাদ\'</strong> একটি গবেষণামূলক সংকলন। মানুষ কোন কিছু পড়ে আনন্দ পায়, যখন সে বক্তব্যটি বোঝে।</p>\r\n<p>নিজের সাথে মিলিয়ে অনুধাবনের সাথে সাথে পড়ার আনন্দ বাড়তে থাকে। কুরআন বোঝার আনন্দ পেতে হলে মহিমান্বিত কুরআন শাব্দিক অনুবাদ অতুলনীয় কারণ &ndash; শাব্দিক অনুবাদের পাশাপাশি কুরআনের বর্ণিত বক্তব্য, প্রেক্ষিত, ঘটনা, স্থান, ভাষা, ইত্যাদির যতটুকু প্রাথমিক জ্ঞান না থাকলে পাঠকের কাছে বিষয়টির পুরোপুরি হৃদয়ঙ্গম কষ্টকর হতে পারে তা সংক্ষিপ্তভাবে যথাস্থানে সন্নিবেশিত হয়েছে।</p>\r\n<p>সহায়ক গ্রন্থ ও রিসোর্স সমূহ বিশ্লেষণপূর্বক প্রজেক্ট গাইডলাইনের আলোকে অনুবাদ প্রামাণিক ও পরিশীলিত করা হয়েছে।</p>\r\n<p><strong>কুরআনের অনুবাদ</strong>, যত নিখুঁতই হোক, অলৌকিক ঐশীগ্রন্থের ভাব-সম্পদ প্রকাশে পুরোপুরি সমর্থ নয়। তবুও মনুষ্য সীমাবদ্ধতার মধ্যেই অভিষ্ট অর্থের কাছাকাছি পৌঁছানোর প্রচেষ্টা আমাদের নিরন্তর। যদিও কুরআনের অনেক অনুবাদ রয়েছে, সেগুলো পাঠককে আরবি শব্দ ও এর অর্থের সাথে সম্পর্ক গড়তে সাহায্য করে না।</p>\r\n<p>এই শাব্দিক অনুবাদের উদ্দেশ্য কুরআনের ভাষা শিখতে সাহায্য করা। এতে--</p>\r\n<ul>\r\n<li>ক। প্রতিটি <strong>শব্দের অর্থ</strong> এর ঠিক নীচে দেওয়া হয়েছে।</li>\r\n<li>খ। আয়াতের অনুবাদগুলো <strong>ভাবার্থের</strong> চেয়ে আরবি শব্দের <strong>সরাসরি অর্থের</strong> কাছাকাছির রাখার চেষ্টা করা হয়েছে। যে ক্ষেত্রে হুবহু শাব্দিক অর্থ আয়াতের ভাব প্রকাশ করে না, সেক্ষেত্রে অভীষ্ট অর্থ বাক্যের অনুবাদে রাখা হয়েছে। পুরো কাজের উদ্দেশ্য পাঠককে সরাসরি আরবি থেকে বুঝতে সক্ষম করা।</li>\r\n<li>গ। অনুবাদে <strong>বাক্যের গঠনশৈলী</strong> কুরআনের আরবি শব্দের ক্রমধারার কাছাকাছি রাখার চেষ্টা করা হয়েছে, যা শিক্ষার্থীর জন্য আরবি ও বাংলা মিলিয়ে অনুধাবন সহায়ক।</li>\r\n<li>ঘ। পবিত্র কুরআনে প্রায় ৮০,০০০ শব্দ রয়েছে তবে মূল শব্দগুলি কেবল ২০০০ এর কাছাকাছি! এটিকে কুরআনের একটি <strong>অলৌকিক নির্দশন</strong> হিসাবেও অভিহিত করা যেতে পারে। যদি কোনও পাঠক প্রতিদিন ১০ টি নতুন শব্দ শেখার সিদ্ধান্ত নেন, তবে তিনি সাত মাসের মধ্যেই এর মূল বার্তাটি বুঝতে পারবেন! সুতরাং, এটি কুরআন বুঝতে খুব উপযোগী, যদি কেউ শিখতে আগ্রহী হয়।</li>\r\n</ul>', '<table class=\"table table-bordered\">\r\n<tbody>\r\n<tr>\r\n<td>বাইন্ডিং</td>\r\n<td>হার্ড কাভার</td>\r\n</tr>\r\n<tr>\r\n<td>কাগজ</td>\r\n<td>৬১ গ্রাম অফসেট অফ হোয়াইট</td>\r\n</tr>\r\n<tr>\r\n<td>সাইজ</td>\r\n<td>১১.২ * ৮ ইঞ্চি</td>\r\n</tr>\r\n<tr>\r\n<td>প্রকাশক</td>\r\n<td>ইলাননূর পাবলিকেশন</td>\r\n</tr>\r\n<tr>\r\n<td>সংকলন</td>\r\n<td>ইলাননূর সম্পাদনা পরিষদ</td>\r\n</tr>\r\n</tbody>\r\n</table>', '<p>&lt;iframe width=\"1068\" height=\"720\" src=\"https://www.youtube.com/embed/Wzs0dohR7Ro\" title=\"মহিমান্বিত কুরআন: মর্মার্থ ও শাব্দিক অনুবাদ মোড়ক উন্মোচন অনুষ্ঠানে প্রধান অতিথির বক্তব্য\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen&gt;&lt;/iframe&gt;</p>', '<p>&lt;!-- Facebook Meta Tags --&gt;<br>&lt;meta property=\"og:url\" content=\"https://www.ilannoor.com/quran-o-hadith/mohimannito-quran/mohimannito-quran-marmartho-o-sabdik-onubad-1/\"&gt;<br>&lt;meta property=\"og:type\" content=\"website\"&gt;<br>&lt;meta property=\"og:title\" content=\"মহিমান্বিত কুরআন &ndash; শাব্দিক অনুবাদ | ilannoor Publication\"&gt;<br>&lt;meta property=\"og:description\" content=\"মহিমান্বিত কুরআন মর্মার্থ ও শাব্দিক অনুবাদ বাংলা ভাষাভাষী মানুষের জন্য কুরআনের মূল বক্তব্য অনুধাবন, কুরানীয় আরবি শেখা ও সংগ্রহে রাখার মত একটি অনবদ্য প্রকাশনা।\"&gt;<br>&lt;meta property=\"og:image\" content=\"https://www.ilannoor.com/images/books/og/542bf03a5a722958dd32c0e40b982879.jpg\"&gt;</p>\r\n<p>&lt;!-- Twitter Meta Tags --&gt;<br>&lt;meta name=\"twitter:card\" content=\"summary_large_image\"&gt;<br>&lt;meta property=\"twitter:domain\" content=\"ilannoor.com\"&gt;<br>&lt;meta property=\"twitter:url\" content=\"https://www.ilannoor.com/quran-o-hadith/mohimannito-quran/mohimannito-quran-marmartho-o-sabdik-onubad-1/\"&gt;<br>&lt;meta name=\"twitter:title\" content=\"মহিমান্বিত কুরআন &ndash; শাব্দিক অনুবাদ | ilannoor Publication\"&gt;<br>&lt;meta name=\"twitter:description\" content=\"মহিমান্বিত কুরআন মর্মার্থ ও শাব্দিক অনুবাদ বাংলা ভাষাভাষী মানুষের জন্য কুরআনের মূল বক্তব্য অনুধাবন, কুরানীয় আরবি শেখা ও সংগ্রহে রাখার মত একটি অনবদ্য প্রকাশনা।\"&gt;<br>&lt;meta name=\"twitter:image\" content=\"https://www.ilannoor.com/images/books/og/542bf03a5a722958dd32c0e40b982879.jpg\"&gt;</p>\r\n<p>&lt;!-- Meta Pixel Code --&gt;<br>&lt;script&gt;<br>!function(f,b,e,v,n,t,s)<br>{if(f.fbq)return;n=f.fbq=function(){n.callMethod?<br>n.callMethod.apply(n,arguments):n.queue.push(arguments)};<br>if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version=\'2.0\';<br>n.queue=[];t=b.createElement(e);t.async=!0;<br>t.src=v;s=b.getElementsByTagName(e)[0];<br>s.parentNode.insertBefore(t,s)}(window, document,\'script\',<br>\'https://connect.facebook.net/en_US/fbevents.js\');<br>fbq(\'init\', \'2124809431030084\');<br>fbq(\'track\', \'PageView\');<br>fbq(\'track\', \'ViewContent\');<br>&lt;/script&gt;<br>&lt;noscript&gt;&lt;img height=\"1\" width=\"1\" style=\"display:none\"<br>src=\"https://www.facebook.com/tr?id=2124809431030084&amp;ev=PageView&amp;noscript=1\"<br>/&gt;&lt;/noscript&gt;<br>&lt;!-- End Meta Pixel Code --&gt;</p>', '<p>মহিমান্বিত কুরআন &ndash; শাব্দিক অনুবাদ | ilannoor Publication</p>', '<p>মহিমান্বিত কুরআন মর্মার্থ ও শাব্দিক অনুবাদ বাংলা ভাষাভাষী মানুষের জন্য কুরআনের মূল বক্তব্য অনুধাবন, কুরানীয় আরবি শেখা ও সংগ্রহে রাখার মত একটি অনবদ্য প্রকাশনা।</p>', 1, 1, 'mohimannito-quran-marmartho-o-sabdik-onubad-front-cover.jpg', NULL, NULL, NULL, NULL, NULL, '2023-07-24 22:53:36', '2023-07-24 23:04:24'),
(2, 'মহিমান্বিত কুরআন – মর্মার্থ ও শাব্দিক অনুবাদ, শুয়ুখ সংস্করণ', 'mohimannito-quran-shuyukh-songskoron', 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'MQ002', '1200', '1200', NULL, 'ইলাননূর পাবলিকেশন', NULL, 'ইলাননূর সম্পাদনা পরিষদ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'mohimannito-quran-shuyukh-songskoron-front-cover.jpg', NULL, NULL, NULL, NULL, NULL, '2023-07-24 22:54:20', '2023-07-24 22:58:15'),
(3, 'The Glorious Quran', 'the-glorious-quran-6', 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'GQ001', '1350', '1500', NULL, 'ইলাননূর পাবলিকেশন', NULL, 'ইলাননূর সম্পাদনা পরিষদ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'the-glorious-quran-front-cover.jpg', NULL, NULL, NULL, NULL, NULL, '2023-07-24 22:54:53', '2023-07-24 22:57:59'),
(4, 'Le Glorieux Saint QUR’AN', 'le-glorieux-saint-quran', 'কুরআন ও হাদিস', 'মহিমান্বিত কুরআন', NULL, 'FQ001', '1250', '1000', NULL, 'ইলাননূর পাবলিকেশন', NULL, 'ইলাননূর সম্পাদনা পরিষদ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'le-glorieux-saint-quran-fornt-cover.jpg', NULL, NULL, NULL, NULL, NULL, '2023-07-24 22:56:09', '2023-07-24 22:58:26');

-- --------------------------------------------------------

--
-- Table structure for table `book_authors`
--

CREATE TABLE `book_authors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `gender` varchar(100) NOT NULL,
  `bio` varchar(199) DEFAULT NULL,
  `mobile` varchar(100) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `address` varchar(199) DEFAULT NULL,
  `description` varchar(199) DEFAULT NULL,
  `youtube_iframe` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `image` text DEFAULT NULL,
  `og` text DEFAULT NULL,
  `banner` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `book_authors`
--

INSERT INTO `book_authors` (`id`, `name`, `slug`, `gender`, `bio`, `mobile`, `email`, `address`, `description`, `youtube_iframe`, `meta_title`, `meta_description`, `image`, `og`, `banner`, `status`, `created_at`, `updated_at`) VALUES
(1, 'ইলাননূর সম্পাদনা পরিষদ', 'illanoor-sompadona-porisod', 'male', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', NULL, '2023-07-24 22:51:09', '2023-07-24 22:51:09');

-- --------------------------------------------------------

--
-- Table structure for table `book_publishers`
--

CREATE TABLE `book_publishers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `mobile` varchar(199) DEFAULT NULL,
  `email` varchar(199) DEFAULT NULL,
  `address` varchar(199) DEFAULT NULL,
  `description` varchar(199) DEFAULT NULL,
  `youtube_iframe` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `image` text DEFAULT NULL,
  `og` text DEFAULT NULL,
  `banner` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `book_publishers`
--

INSERT INTO `book_publishers` (`id`, `name`, `slug`, `mobile`, `email`, `address`, `description`, `youtube_iframe`, `meta_title`, `meta_description`, `image`, `og`, `banner`, `status`, `created_at`, `updated_at`) VALUES
(1, 'ইলাননূর পাবলিকেশন', 'ilannoor-publication', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', NULL, '2023-07-24 22:50:26', '2023-07-24 22:50:26');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `category_name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `description` tinytext DEFAULT NULL,
  `meta_title` tinytext DEFAULT NULL,
  `meta_description` tinytext DEFAULT NULL,
  `icon` text NOT NULL,
  `thumb` text NOT NULL,
  `cover` text NOT NULL,
  `og_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `category_name`, `slug`, `description`, `meta_title`, `meta_description`, `icon`, `thumb`, `cover`, `og_image`, `created_at`, `updated_at`) VALUES
(1, 'কুরআন ও হাদিস', 'quran-and-hadith', NULL, NULL, NULL, 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', '2023-07-24 22:52:13', '2023-07-24 22:52:13');

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `hires`
--

CREATE TABLE `hires` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `homes`
--

CREATE TABLE `homes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2023_03_21_065012_create_homes_table', 1),
(7, '2023_03_21_065207_create_contacts_table', 1),
(8, '2023_03_21_065214_create_hires_table', 1),
(9, '2023_03_21_065238_create_privacy_policies_table', 1),
(10, '2023_03_21_065521_create_template_table', 1),
(11, '2023_03_21_065536_create_site_templates_table', 1),
(12, '2023_03_21_065551_create_terms_of_services_table', 1),
(13, '2023_03_21_065606_create_why_our_themes_table', 1),
(14, '2023_03_21_065737_create_skeletons_table', 1),
(15, '2023_03_21_073413_create_abouts_table', 1),
(16, '2023_04_13_085244_template_details', 1),
(17, '2023_04_13_090645_create_templates_table', 1),
(18, '2023_04_13_091925_template', 1),
(19, '2023_04_13_092130_drop_table_template_details', 1),
(20, '2023_04_13_092326_drop_table_templates', 1),
(21, '2023_04_13_092417_templates', 1),
(22, '2023_04_13_094322_templates', 1),
(23, '2023_04_13_094425_create_templates_table', 1),
(24, '2023_04_13_095421_drop_table_templates', 1),
(25, '2023_04_13_095441_create_templates_table', 1),
(26, '2023_04_15_083833_drop_table_template', 1),
(27, '2023_04_15_083955_create_templates_table', 1),
(28, '2023_05_22_103504_create_categories_table', 1),
(29, '2023_05_22_103514_create_sub_categories_table', 1),
(30, '2023_05_22_103522_create_sub_sub_categories_table', 1),
(31, '2023_05_24_104323_drop_categories', 1),
(32, '2023_05_24_104446_change_categories_table', 1),
(33, '2023_06_10_083431_create_table_books', 1),
(34, '2023_06_11_045739_create_subcategories', 1),
(35, '2023_06_11_045859_create_sub_subcategories', 1),
(36, '2023_06_11_061030_create_publishers', 1),
(37, '2023_06_11_061100_create_book_publishers', 1),
(38, '2023_06_11_091106_create_book_authors', 1),
(39, '2023_06_19_041400_create_audios', 2),
(40, '2023_03_21_065117_create_blogs_table', 3);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `privacy_policies`
--

CREATE TABLE `privacy_policies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `publishers`
--

CREATE TABLE `publishers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `site_templates`
--

CREATE TABLE `site_templates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `skeletons`
--

CREATE TABLE `skeletons` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `subcategories`
--

CREATE TABLE `subcategories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `subcategory_name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `category_name` varchar(199) NOT NULL,
  `description` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `icon` text NOT NULL,
  `thumb` text NOT NULL,
  `cover` text NOT NULL,
  `og_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `subcategories`
--

INSERT INTO `subcategories` (`id`, `subcategory_name`, `slug`, `category_name`, `description`, `meta_title`, `meta_description`, `icon`, `thumb`, `cover`, `og_image`, `created_at`, `updated_at`) VALUES
(1, 'মহিমান্বিত কুরআন', 'mohimannito-quran', 'কুরআন ও হাদিস', NULL, NULL, NULL, 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', 'ilannoor-publication-logo.png', '2023-07-24 22:52:58', '2023-07-24 22:52:58');

-- --------------------------------------------------------

--
-- Table structure for table `sub_categories`
--

CREATE TABLE `sub_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sub_category_name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `category_name` varchar(199) NOT NULL,
  `description` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `icon` text NOT NULL,
  `thumb` text NOT NULL,
  `cover` text NOT NULL,
  `og_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sub_subcategories`
--

CREATE TABLE `sub_subcategories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sub_subcategory_name` varchar(199) NOT NULL,
  `subcategory_name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `description` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `icon` text NOT NULL,
  `thumb` text NOT NULL,
  `cover` text NOT NULL,
  `og_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sub_sub_categories`
--

CREATE TABLE `sub_sub_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sub_sub_category_name` varchar(199) NOT NULL,
  `sub_category_name` varchar(199) NOT NULL,
  `slug` varchar(199) NOT NULL,
  `description` varchar(199) DEFAULT NULL,
  `meta_title` varchar(199) DEFAULT NULL,
  `meta_description` varchar(199) DEFAULT NULL,
  `icon` text NOT NULL,
  `thumb` text NOT NULL,
  `cover` text NOT NULL,
  `og_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `templates`
--

CREATE TABLE `templates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `slug` varchar(100) NOT NULL,
  `category_name` varchar(100) NOT NULL,
  `sub_category_name` varchar(100) DEFAULT NULL,
  `sub_sub_category_name` varchar(100) DEFAULT NULL,
  `sale_price` varchar(100) DEFAULT NULL,
  `regular_price` varchar(100) NOT NULL,
  `commission` varchar(100) DEFAULT NULL,
  `bootstrap_v` varchar(100) NOT NULL,
  `released` datetime DEFAULT NULL,
  `updated` datetime DEFAULT NULL,
  `version` varchar(100) NOT NULL,
  `seller_name` varchar(100) NOT NULL,
  `seller_email` varchar(100) NOT NULL,
  `short_description` tinytext DEFAULT NULL,
  `long_description` tinytext DEFAULT NULL,
  `change_log` tinytext DEFAULT NULL,
  `youtube_iframe` text DEFAULT NULL,
  `header_content` text DEFAULT NULL,
  `meta_title` text DEFAULT NULL,
  `meta_description` text DEFAULT NULL,
  `live_preview_link` text DEFAULT NULL,
  `downloadable_link` text DEFAULT NULL,
  `image` text DEFAULT NULL,
  `file` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT 0,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `terms_of_services`
--

CREATE TABLE `terms_of_services` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'ilannoor', 'support@ilannoor.com', NULL, '$2y$10$EAtkKgoB61iAHY6SXLL8veoW7B/yhEnAFVok0EAM.A2yCmgZ99afG', NULL, '2023-07-24 00:34:30', '2023-07-24 00:34:30');

-- --------------------------------------------------------

--
-- Table structure for table `why_our_themes`
--

CREATE TABLE `why_our_themes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `abouts`
--
ALTER TABLE `abouts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `audios`
--
ALTER TABLE `audios`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `blogs`
--
ALTER TABLE `blogs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `book_authors`
--
ALTER TABLE `book_authors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `book_publishers`
--
ALTER TABLE `book_publishers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `hires`
--
ALTER TABLE `hires`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `homes`
--
ALTER TABLE `homes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `privacy_policies`
--
ALTER TABLE `privacy_policies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `publishers`
--
ALTER TABLE `publishers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `site_templates`
--
ALTER TABLE `site_templates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `skeletons`
--
ALTER TABLE `skeletons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `subcategories`
--
ALTER TABLE `subcategories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sub_categories`
--
ALTER TABLE `sub_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sub_subcategories`
--
ALTER TABLE `sub_subcategories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sub_sub_categories`
--
ALTER TABLE `sub_sub_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `templates`
--
ALTER TABLE `templates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `terms_of_services`
--
ALTER TABLE `terms_of_services`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `why_our_themes`
--
ALTER TABLE `why_our_themes`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `abouts`
--
ALTER TABLE `abouts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `audios`
--
ALTER TABLE `audios`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `blogs`
--
ALTER TABLE `blogs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `book_authors`
--
ALTER TABLE `book_authors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `book_publishers`
--
ALTER TABLE `book_publishers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `hires`
--
ALTER TABLE `hires`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `homes`
--
ALTER TABLE `homes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `privacy_policies`
--
ALTER TABLE `privacy_policies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `publishers`
--
ALTER TABLE `publishers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `site_templates`
--
ALTER TABLE `site_templates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `skeletons`
--
ALTER TABLE `skeletons`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `subcategories`
--
ALTER TABLE `subcategories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `sub_categories`
--
ALTER TABLE `sub_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sub_subcategories`
--
ALTER TABLE `sub_subcategories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sub_sub_categories`
--
ALTER TABLE `sub_sub_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `templates`
--
ALTER TABLE `templates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `terms_of_services`
--
ALTER TABLE `terms_of_services`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `why_our_themes`
--
ALTER TABLE `why_our_themes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
